The current document.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public Document Document { get; }
  Visual Basic
Public ReadOnly Property Document As Document
	Get
  Visual C++
public:
property Document^ Document {
	Document^ get ();
}
 See Also
  CodeCheckingParameterServiceData Class
  Autodesk.Revit.DB.Structure Namespace